UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_СозданиеНоменклатуры/рар_мп_СозданиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_СозданиеНоменклатуры</name>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_СозданиеНоменклатуры/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	рар_мп_УправлениеЭлементамиФормыКлиентСервер.УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(ЭтотОбъект, "ТоварыДляСозданияНоменклатуры","ТоварыДляСозданияНоменклатурыХарактеристика","ТоварыДляСозданияНоменклатурыУпаковка");
    ГиперссылкаРегистрСведенийСопостовлениеТоваров = "Сопоставление товаров (1С-Рарус)";																				

КонецПроцедуры
	
#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура АккаунтПриИзмененииНаСервере()
	
	ТоварыДляСозданияНоменклатуры.Очистить();
			
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда 
		
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыРазмер.Видимость  	
			= Истина;		
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыSKUТовара.Видимость	
			= Ложь;				
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыСтавкаНДС.Видимость	
			= Ложь;
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыIDТовара.Видимость	
			= Истина;
		Элементы.УстановитьСтавкуНДС.Видимость 																		
			= Ложь;
		ВидНоменклатуры
			= Неопределено;			
		Элементы.СоздаватьНоменклатуруОтдельноДляКаждогоРазмера.Видимость
			= Истина;
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыIDРазмера.Видимость	
			= Истина;	
			      	
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыРазмер.Видимость  	
			= Ложь;		
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыSKUТовара.Видимость 
			= Истина;				
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыСтавкаНДС.Видимость	
			= Ложь;
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыIDТовара.Видимость	
			= Ложь;	
	    Элементы.УстановитьСтавкуНДС.Видимость 																		
			= Ложь;
		ВидНоменклатуры
			= Неопределено;
		Элементы.СоздаватьНоменклатуруОтдельноДляКаждогоРазмера.Видимость
			= Ложь;
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыIDРазмера.Видимость	
			= Ложь;	
				
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.OZON Тогда	
		
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыРазмер.Видимость  	
			= Ложь;		
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыSKUТовара.Видимость	
			= Истина;				
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыСтавкаНДС.Видимость	
			= Истина;
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыIDТовара.Видимость	
			= Истина;
        Элементы.УстановитьСтавкуНДС.Видимость 																		
			= Истина;
		ВидНоменклатуры
			= Неопределено;
		Элементы.СоздаватьНоменклатуруОтдельноДляКаждогоРазмера.Видимость
			= Ложь;
		Элементы.ТоварыДляСозданияНоменклатуры.ПодчиненныеЭлементы.ТоварыДляСозданияНоменклатурыIDРазмера.Видимость	
			= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АккаунтПриИзменении(Элемент)
	АккаунтПриИзмененииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыДляСозданияНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТоварыДляСозданияНоменклатуры.ТекущиеДанные;	
	ТекущаяСтрока.ИзменитьПозицию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаРегистрСведенийСопостовлениеТоваровНажатие(Элемент, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("АккаунтМаркетплейса", АккаунтМаркетплейса);
		
	ОткрытьФорму("Обработка.рар_мп_СопоставлениеТоваров.Форма.Форма", ПараметрыОткрытия);

КонецПроцедуры
	
#КонецОбласти


#Область ЗагрузкаСпискаТоваровИзМаркетплейсов

&НаКлиенте
Процедура ЗагрузитьСписокТоваров(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		ТоварыДляСозданияНоменклатуры.Очистить();
		
		ДлительнаяОперация						= ЗагрузитьСписокТоваровНаСервере();
		ПараметрыОжидания      					= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения 	= Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания 	= Истина;
		ПараметрыОжидания.ТекстСообщения = "Получение товаров из маркетплейса ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузкиСпискаТоваров", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания); 
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьСписокТоваровНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Ozon Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
																"рар_мп_СозданиеНоменклатуры.ПолучитьСписокТоваровСХарактеристиками_Ozon", 
																	АккаунтМаркетплейса,ВидНоменклатуры);
		Возврат ВозвратныеДанные;

		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
																"рар_мп_СозданиеНоменклатуры.ПолучитьСписокТоваровСХарактеристиками_ЯндексМаркет", 
																	АккаунтМаркетплейса, ВидНоменклатуры);
			
		Возврат ВозвратныеДанные;
			
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда 
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
		
    	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
        														"рар_мп_СозданиеНоменклатуры.ПолучитьСписокТоваровСХарактеристиками_Wildberries",
   	 																АккаунтМаркетплейса, ВидНоменклатуры);

   	 Возврат ВозвратныеДанные;
		
	КонецЕсли;   
	
КонецФункции

&НаСервере
Процедура ЗавершениеЗагрузкиСпискаТоваровНаСервере(Результат)
	
	ВозвратныеДанные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
	Попытка 	
		
		ТоварыДляСозданияНоменклатуры.Загрузить(ВозвратныеДанные);
	
		Для Каждого СтрокаТабличнойЧасти Из ТоварыДляСозданияНоменклатуры Цикл
		
			СтрокаТабличнойЧасти.ИзменитьПозицию = Истина;
		
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка товаров завершена.";
		Сообщение.Сообщить();
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при загрузке товаров из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке товаров из маркетплейса в табличную часть", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗагрузкиСпискаТоваров(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеЗагрузкиСпискаТоваровНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при загрузке товаров из маркетплейса. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область СозданиеНоменклатуры 

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)	
	
	Если ПроверитьЗаполнение() Тогда
		
		Если ТоварыДляСозданияНоменклатуры.Количество() > 0 Тогда
			
			ДлительнаяОперация						= СоздатьНоменклатуруНаСервере();
			ПараметрыОжидания						= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьСообщения		= Истина;
			ПараметрыОжидания.ВыводитьОкноОжидания	= Истина;
			ПараметрыОжидания.ТекстСообщения 		= "Создание номенклатуры ...";
			Оповещение = Новый ОписаниеОповещения("ЗавершениеСозданияНоменклатуры", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не загружены товары из маркетплейса");
			Сообщение.Сообщить();
			
		КонецЕсли;	
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруНаСервере()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	ВозвратныеДанные	= ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_СозданиеНоменклатуры.СоздатьНоменклатуру", 
																	АккаунтМаркетплейса, ТоварыДляСозданияНоменклатуры.Выгрузить(), 
																		ВидНоменклатуры, УстановитьСтавкуНДС, СоздаватьНоменклатуруОтдельноДляКаждогоРазмера); 
														
	Возврат ВозвратныеДанные; 
	
КонецФункции 

&НаКлиенте
Процедура ЗавершениеСозданияНоменклатуры(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда		
			
		ЗавершениеСозданияНоменклатурыНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при создании номенклатуры. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСозданияНоменклатурыНаСервере(Результат)
	
	ТЗВозвратныеДанные 	= ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
		
		ТоварыДляСозданияНоменклатуры.Загрузить(ТЗВозвратныеДанные);
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создание номенклатуры завершено.";
		Сообщение.Сообщить(); 	
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при создании номенклатуры. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке в табличную часть", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;	
	
КонецПроцедуры


#КонецОбласти


#Область СопоставлениеНоменклатуры

&НаКлиенте
Процедура СопоставитьНоменклатуру(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если ТоварыДляСозданияНоменклатуры.Количество() > 0 Тогда
	         	
			ДлительнаяОперация						= СопоставитьНоменклатуруНаСервере();
			ПараметрыОжидания						= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьСообщения		= Истина;
			ПараметрыОжидания.ВыводитьОкноОжидания	= Истина;
			ПараметрыОжидания.ТекстСообщения 		= "Сопоставление номенклатуры ...";
			Оповещение = Новый ОписаниеОповещения("ЗавершениеСопостовленияНоменклатуры", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не загружены товары из маркетплейса");
			Сообщение.Сообщить();	
			
		КонецЕсли;	
		
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция СопоставитьНоменклатуруНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	ВозвратныеДанные	= ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
																"рар_мп_СозданиеНоменклатуры.СопоставитьНоменклатуру", 
																	ТоварыДляСозданияНоменклатуры.Выгрузить(), АккаунтМаркетплейса); 
														
	Возврат ВозвратныеДанные;	
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеСопостовленияНоменклатуры(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
    	ЗавершениеСопостовленияНоменклатурыНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при сопоставлении номенклатуры. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСопостовленияНоменклатурыНаСервере(Результат)
	
	ВозвратныеДанные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Номенклатура успешно сопоставлена";
		Сообщение.Сообщить();		
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при сопоставлении номенклатуры. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке в табличную часть", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;	

КонецПроцедуры
 	
#КонецОбласти 


#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ВыбратьВсеСтроки(Команда)

	Для каждого Стр Из ТоварыДляСозданияНоменклатуры Цикл
	
		Стр.ИзменитьПозицию = Истина;	
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсехСтрок(Команда)

	Для каждого Стр Из ТоварыДляСозданияНоменклатуры Цикл
		
		Стр.ИзменитьПозицию = Ложь;	
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
